<template>
  <v-card-text>
    <v-list-item v-for="item in items" :key="item.title">
      <v-list-item-content class="text-left">
        <v-list-item-title v-text="item.title" />
        <v-list-item-subtitle
          v-for="content in item.content"
          :key="content"
          v-text="content"
        />
      </v-list-item-content>
    </v-list-item>
  </v-card-text>
</template>

<script>
export default {
  data() {
    return {
      items: [
        {
          title:
            '立脚点の違いによって相互予測問題を解消する強化学習エージェント',
          content: [
            '日本認知科学会第38回大会論文集, pp. 51-57, Sep. 2021',
            '高田亮介, 竹内勇剛',
            '(査読あり, 口頭発表)'
          ]
        },
        {
          title: '強化学習を用いた缶蹴りエージェントによる協調行動の獲得',
          content: [
            '第35回人工知能学会全国大会論文集, 3I2-GS-5e-03, Jun. 2021',
            '高田亮介, 坂本孝丈, 竹内勇剛',
            '(査読あり, 口頭発表)'
          ]
        },
        {
          title: '缶蹴りにおける他者知覚を必要としない協調の実現',
          content: [
            'HAIシンポジウム2021, G-20, Mar. 2021',
            '高田亮介, 坂本孝丈, 竹内勇剛',
            '(査読なし, 口頭発表, Student Encouragement Award 受賞)'
          ]
        },
        {
          title:
            '強化学習を用いたエージェントによる缶蹴りの集団形成と振る舞い分析',
          content: [
            'ヒューマンインタフェースサイバーコロキウム論文集, pp. 81-88, Oct. 2020',
            '高田亮介, 坂本孝丈, 竹内勇剛',
            '(査読なし, 口頭発表, 優秀発表賞 受賞)'
          ]
        },
        {
          title: '缶蹴りにおける強化学習を用いた身体的インタラクション',
          content: [
            '日本認知科学会第37回大会論文集, pp. 384-391, Sep. 2020',
            '高田亮介, 竹内勇剛',
            '(査読あり, ポスター発表)'
          ]
        },
        {
          title:
            'ニューロエボリューションを用いたクリーチャによる協調行動の分析',
          content: [
            '第34回人工知能学会全国大会論文集, 4Rin1-64, Jun. 2020',
            '高田亮介, 竹内勇剛',
            '(査読あり, ポスター発表)'
          ]
        },
        {
          title:
            '身体的特徴が異なるエージェントにおける立位熟達過程の分析 -ニューロエボリューションによる進化的学習に注目して-',
          content: [
            '第34回人工知能学会全国大会論文集, 4Rin1-19, Jun. 2020',
            '山田雅敏, 高田亮介, 坂本孝丈, 竹内勇剛',
            '(査読あり, ポスター発表)'
          ]
        },
        {
          title: '強化学習を通したクリーチャによる協調行動の自動獲得',
          content: [
            'HAIシンポジウム2020, G-7, Mar. 2020',
            '高田亮介, 竹内勇剛',
            '(査読なし, 口頭発表)'
          ]
        },
        {
          title:
            'アクションゲームAIにおける共進化と動機づけの分析～ボンバーマンを題材として～',
          content: [
            '第9回サイエンス・インカレ, Mar. 2020',
            '高田亮介',
            '(査読あり, 口頭発表, COVID-19により大会中止)'
          ]
        },
        {
          title:
            'ニューロエボリューションによるエージェントの立位獲得過程に関する研究',
          content: [
            '第8回浜松アカデミックカンファレンス, Feb. 2020',
            '山田雅敏, 高田亮介, 竹内勇剛',
            '(査読なし, 口頭発表)'
          ]
        },
        {
          title:
            'アクションゲームの裏技を発見する自己学習手法～スーパーマリオブラザーズを題材として～',
          content: [
            '第8回サイエンス・インカレ, Mar. 2019',
            '高田亮介',
            '(査読あり, 口頭発表, 審査員特別賞 受賞)'
          ]
        },
        {
          title:
            '無限1UPを題材としたアクションゲームの裏技を発見する自己学習手法の提案',
          content: [
            '第39回情報処理学会ゲーム情報学研究会, Mar. 2018',
            '高田亮介, 橋本剛',
            '(査読なし, 口頭発表, 若手奨励賞 受賞)'
          ]
        },
        {
          title: '第1回スモウルビー甲子園優勝プログラムと将来の展望',
          content: [
            '第58回プログラミング・シンポジウム予稿集, pp. 81-83, Jan. 2017',
            '高田亮介, 加藤聡',
            '(査読なし, ポスター発表)'
          ]
        }
      ]
    }
  }
}
</script>
